{"data":{"allMarkdownRemark":{"edges":[{"node":{"id":"6b542aff-53c1-5f58-8ad9-1a4fde2dada8","html":"<p>When Kyma was introduced to the public a few weeks ago at <a href=\"https://cloud.withgoogle.com/next18/sf/\">Google Cloud Next ’18</a>, we talked about the strong partnership that we have with the Knative community. Kyma and Knative provide two complementary sets of building blocks, which together offer a powerful framework and a toolset to build cloud-native solutions on top of Kubernetes.</p>\n<p>\n  <span\n    class=\"gatsby-resp-image-wrapper\"\n    style=\"position: relative; display: block; ; max-width: 942px; margin-left: auto; margin-right: auto;\"\n  >\n    <span\n      class=\"gatsby-resp-image-background-image\"\n      style=\"padding-bottom: 51.69851380042463%; position: relative; bottom: 0; left: 0; background-image: url('data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAABQAAAAKCAIAAAA7N+mxAAAACXBIWXMAAA7DAAAOwwHHb6hkAAABT0lEQVQoz3VRO04DMRDd43ACCmpqRMVBaDgBEgUFBRQUXICCEgQFIEVCqSLRQNAiEfB6I4eskhh2bY/tMbPr/BSUp5U1fut5bz5JmAEAjDF0hvUAh87j/JrMo6IoOOd5niulViTi866Adk+l32D9v+SIqqp4AyklFWKtjTz53byU22f5yeMYcaqYLMsTG39orTnPcs6knIQwJd8E3L1WHaYRl5wR0VhvwFNBFMSuwIUfhRrq2DoEV/POIS5aDgm9rrSrjMuGOs2q4RhIhRgxgk+hByOjwE9K2xP6a2BSrgoJ2njbTC6xMzE6vQ/xQg6+8a8baUxq2/qb9k8G1mISMz3i/uXz7unTxe37h/iNI/DeZ4zlnK/bXBIdWt3BxsH11tHDznFLaTcfkm1A++v3+6S1mhzrFFLvnbc3D++vOjwWstgCUgu+LEvGmBBiWeIPUBw8jwKSIDgAAAAASUVORK5CYII='); background-size: cover; display: block;\"\n    >\n      <img\n        class=\"gatsby-resp-image-image\"\n        style=\"width: 100%; height: 100%; margin: 0; vertical-align: middle; position: absolute; top: 0; left: 0; box-shadow: inset 0px 0px 0px 400px white;\"\n        alt=\"Kyma and Knative\"\n        title=\"\"\n        src=\"/static/1-kyma-knative-3e84475451c89bc10b90ee375732b367-78475.png\"\n        srcset=\"/static/1-kyma-knative-3e84475451c89bc10b90ee375732b367-06d5c.png 300w,\n/static/1-kyma-knative-3e84475451c89bc10b90ee375732b367-385cc.png 600w,\n/static/1-kyma-knative-3e84475451c89bc10b90ee375732b367-78475.png 942w\"\n        sizes=\"(max-width: 942px) 100vw, 942px\"\n      />\n    </span>\n  </span>\n  </p>\n<p>If you look at the Kyma source code right now, you might wonder why you are not finding many references to Knative. The answer is quite simple. In the last month and a half, the entire Kyma team has been working on restructuring the repositories, making them ready to go open source and removing all internal references and tool dependencies. We've done all of that from a stable branch.  </p>\n<p>In parallel to those major changes, we have a fork with Kyma and Knative integrated. It was used to build some first proof-of-concept cloud-native solutions using Knative and Kyma deployed together. The fork is also the basis for our stage demo shown during <a href=\"https://www.youtube.com/watch?v=NaaGPGKyXEc&#x26;t=42m50s\">the project launch</a>. This was our first approach at combining the projects. As both Kyma and Knative are really young and going through a number of changes, some of our design decisions have not been optimal in retrospect. </p>\n<p>During the coming weeks, our plan is to refactor the current Kyma codebase and modularize it. Several functional components can then be installed optionally, which will certainly improve the experience when developing locally using for example <a href=\"https://kubernetes.io/docs/tasks/tools/install-minikube/\">Minikube</a>. </p>\n<p>As shared technologies such as <a href=\"https://istio.io/\">Istio</a> are concerned, we're going to provide needed configuration options so that Istio deployed with Knative will also support all Kyma's requirements. </p>\n<p>And finally, we are going to extract some components. For example, we'll extract Kyma eventing and fully integrate it with Knative eventing. We'll evaluate the possibility of contributing the Kyma eventing based on <a href=\"https://nats.io/\">NATS</a> streaming as a Knative compatible eventing implementation to the Knative project. Users of Knative and Kyma will than have the additional option of deciding which eventing implementation to use (e.g. as an alternative to the Knative provided Kafka based implementation). </p>\n<p>Stay tuned for more updates! Remember! Your ideas and proposals are highly welcome. Don't be shy!  </p>","frontmatter":{"date":"August 10, 2018","path":"/blog/kyma-knative-progress-report","title":"Kyma and Knative Integration - Progress Update","author":"Ralf Hofmann, Kyma Cloud Software Architecture","tags":["kyma","cloud","native","GoogleNext2018","knative","istio","kubernetes"]}}},{"node":{"id":"f1e6f965-dea7-5eaa-8661-68b92d738161","html":"<p>At SAP we typically deal with lots of enterprise software coming from a variety of different vendors. We've helped many of our customers and partners in all industries to model software to their needs and unique business processes. To meet the desire for flexibility, we see a growing demand for openness and modern architecture in this space. That's why we decided to spin the development of our new extension framework, Kyma, out in open source. We’d like to encourage all of you to take a look, get involved and lend a hand to expand Kyma to cover even more exciting extension scenarios.</p>\n<p>The ideas and concepts in Kyma result out of long years of experience in customizing different SAP and SAP Hybris solutions. It lets you create serverless applications, mashups and micro services – all running on the underlying Kubernetes+Istio – both serving as the foundation of Kyma. On top we enable developers to quickly code small customization modules and extension apps, interweaved with the business logic of the extended enterprise application. </p>\n<p>And then <a href=\"https://cloud.google.com/knative/\">Knative</a> came into the picture. Build from the ground up to support, container-based and cloud-native applications – it provides building blocks for developers to build and deploy container-based serverless applications anywhere on Kubernetes. Sounds familiar, right? All of us at SAP were super excited to see that the Knative dev team has taken very similar technology decisions. It felt like a validation of our Kyma scenarios from one side as well as the technology vision we had in the broader SAP Hybris team from another. From that point on – it was clear that Kyma and Knative are bound to grow together. On our end – we’ve refactored Kyma to leverage Knative configuration, build and serving components already from the on-start. We dropped some of the overlapping components, making Kyma leaner and more streamlined. We got as well all-in involved in Knative, having the opportunity to work with the incredible Google Cloud team.</p>\n<p>A quote coming from the discussions, that stuck and made the whole Kyma team at SAP incredibly proud was:</p>\n<blockquote>\n<p>\"SAP's extensive enterprise expertise and far-reaching commercial experience made for an ideal partnership as we developed Knative. SAP brought informed customer-driven use-cases to the table, helping us collectively shape the capabilities of Knative to meet the needs of real-world businesses. Knative and SAP Kyma make a perfect fit, and we look forward to the ongoing technical collaboration.” -DeWitt Clinton, Google Cloud</p>\n</blockquote>\n<p>This collaboration gives us the chance to focus Kyma on the higher-level enterprise application connectivity and service consumption scenarios, relying on Knative for all the low-level infrastructure and development scenarios. </p>\n<p>We strongly believe in open technologies and open collaboration. Our goal is to join forces with interested parties out there and to build the most flexible extension framework for any SaaS applications to be customized and extended.  </p>\n<p>Got you interested? Want to get involved? Get in touch with us via <a href=\"https://twitter.com/kymaproject\">Twitter</a>, <a href=\"https://github.com/kyma-project\">GitHub</a> or our <a href=\"https://join.slack.com/t/kyma-community/shared_invite/enQtNDAwNzE4Mjk2NDE3LTJhOTlmZjM5YzkwNmEzNmY3ZjE2MTU2OTMxOGE4ZDM0MmU4ZWRkZGJiODgzNmRmMTYxMDYwNjZiMDAwMTA2OWM\">Slack</a> channel. We would also be very happy if you simply let us know your take on this!</p>\n<p>Stay tuned for more updates... and have a great #GoogleNext2018!</p>","frontmatter":{"date":"July 24, 2018","path":"/blog/introducing-project-kyma","title":"Introducing project Kyma","author":"Krasimir Semerdzhiev, Kyma Open Source Strategist","tags":["kyma","cloud","native","GoogleNext2018","knative","istio","kubernetes"]}}}]}},"pageContext":{}}