{"data":{"markdownRemark":{"id":"9ceb77f3-2424-5c86-9260-4446c38d3959","html":"<p>Now that Kyma is out there available to the world you are most probably keen on testing and implementing your own scenarios leveraging Kyma. Well, we are happy to introduce you to a getting started guide for developers which is [a sample application based on Spring Boot] (<a href=\"https://github.com/kyma-incubator/examples/tree/master/personservice\">https://github.com/kyma-incubator/examples/tree/master/personservice</a>) showing the features on Kyma.</p>\n<p>This hands-on guide provides an end-to-end example application implementation in Java and Spring Boot running on Kyma. In the end state, you as a developer will understand all the features Kyma delivers. To summarize, this guide teaches you how to:</p>\n<ul>\n<li>Deploy the application locally to Kyma (based on minikube) or to an actual Kyma cluster </li>\n<li>Connect your service to Kyma as an extension platform and run a scenario</li>\n<li>Extend business applications with Kyma through event-driven, Lambda (serverless) functions</li>\n<li>Bind your application to a brokered backing service</li>\n<li>Add authentication and authorization</li>\n<li>Leverage Kubernetes Self-Healing</li>\n<li>Use tracing and logging support</li>\n</ul>\n<p>We would like to hear your feedback. If you face any issues or have any comments while testing Kyma, feel free to report them on <a href=\"https://github.com/kyma-incubator/examples\">GitHub</a>.  </p>\n<p>We also invite you to join the Kyma community on <a href=\"https://twitter.com/kymaproject\">Twitter</a> and <a href=\"https://www.linkedin.com/company/kyma-project/\">LinkedIn</a>. </p>\n<p>Have fun with Kyma! </p>","frontmatter":{"date":"September 24, 2018","path":"/blog/blog-post-person-service","title":"Get started guide for developers on Kyma","author":"Andreas Krause, Kyma Cloud Software Enablement","tags":["kyma","cloud","native","application","extension","example","integration"]}}},"pageContext":{}}