{"data":{"markdownRemark":{"id":"dcbf4592-a5ad-5e6a-8b40-87aff7d03fe2","html":"<p><a href=\"https://github.com/Knative/\">Knative</a> is an important new project in the cloud-native world that was announced as a \"Kubernetes-based platform to build, deploy, and manage modern serverless workloads.\" It is an opinionated approach covering the best practices around three areas of developing cloud-native applications: building containers (and functions), serving (and dynamically scaling) workloads, and eventing. Knative is an open-source set of components and is being actively developed by Google in close partnership with Pivotal, IBM, Red Hat, and SAP.</p>\n<p>Similarly to Kubeless, Knative provides a set of building blocks to simplify the use of Kubernetes and Istio for managing and operating lambda functions. Kubeless takes some code, builds an image out of it, and starts it on Kubernetes. Knative is doing the same by following a more modular approach, allowing different components to be pluggable and adaptable to different deployment scenarios.</p>\n<p>Because of this more flexible approach, we are planning to replace the current Kubeless-based Lambda Functions in Kyma with a Knative-based implementation. To provide the same commodity to which users are used with Kubeless, we have to do some extra work.</p>\n<h2>Architecture</h2>\n<p>So far, the architecture is not shaped out fully. Many details have to be sorted out and defined. The idea is to use Knative as it is and try to bridge the existing gaps using custom components, other available open-source projects (e.g. <a href=\"https://projectriff.io/\">Riff</a>), or pushing enhancements to the Knative community. In the end, Knative should provide the same functionality as Kubeless is doing today.</p>\n<p>\n  <span\n    class=\"gatsby-resp-image-wrapper\"\n    style=\"position: relative; display: block; ; max-width: 409px; margin-left: auto; margin-right: auto;\"\n  >\n    <span\n      class=\"gatsby-resp-image-background-image\"\n      style=\"padding-bottom: 107.82396088019561%; position: relative; bottom: 0; left: 0; background-image: url('data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAABQAAAAWCAYAAADAQbwGAAAACXBIWXMAAAsSAAALEgHS3X78AAACDUlEQVQ4y4WV167CQAxE9/9/iXfEI/CEKEJ0RO8djI6lQb5J4FpasdmMx+OyIY3HYzudTrbf7+1wOPhiz+J8Op1atVq1er1uESt89NvtdpbW67WDjsejH/Irp+1266DZbGbz+dyfhRWe581m8/FNj8fD7ve73W43GwwG1mg0rNlsWq/Xc4LX62XP59MXWHDg2YMHR9DL5eJnyYLhdL1e/SUKSVFkRcY5AUajkQfBEgq0MNUC+fyiEge9j8bZarUyyrZcLp00CahflEkVajGIUaL0SQ2jdgRTYJ5TjCZnrN1uW6lU8i6jFgdIVRL2KGu1WlapVHxP83KEUogje9RQBkhUp2iTycQbg9I/TYmEOCs1fkmFPRgCKWWe2Z/P50+Zck2RIkhIQUMba026qulisfBy0ByCJftigBnaX8ZYsSASaaIuSI0DrOZwOzRvwgiHkSpEqISHBia6VKvVPD0A8VrpOhUtpUx3qTsCPGW6xFByoItOqkRlxY+BxofUpFKNkvoEGQaw2+1+0iQyjcEg4h2qsE6n47j4tVHQhArNGKQaAQhZuq8oBQOWc3D6sGj5HKIClZARud/ve0qKjDNDS411Zzn/9sHI3WXUkCLRUAN59oZEn+xKEaCoqh9kqMs6Z0lzCrNgiEgRUl27IkWFhDENvYSkXC77fwnkkfA/S0W1YSYZk+Fw6OlnA/6yNxkerdGfKtI9AAAAAElFTkSuQmCC'); background-size: cover; display: block;\"\n    >\n      <img\n        class=\"gatsby-resp-image-image\"\n        style=\"width: 100%; height: 100%; margin: 0; vertical-align: middle; position: absolute; top: 0; left: 0; box-shadow: inset 0px 0px 0px 400px white;\"\n        alt=\"Serverless Kyma Architecture\"\n        title=\"\"\n        src=\"/static/3-serverless-kyma-architecture-64cc827600f930648359faad8f242539-091ba.png\"\n        srcset=\"/static/3-serverless-kyma-architecture-64cc827600f930648359faad8f242539-3586d.png 300w,\n/static/3-serverless-kyma-architecture-64cc827600f930648359faad8f242539-091ba.png 409w\"\n        sizes=\"(max-width: 409px) 100vw, 409px\"\n      />\n    </span>\n  </span>\n  </p>\n<p>The core of the architecture are the Knative <code>Serving</code> and <code>Build</code> components. As a Kyma-related component, a custom build template is required to provide the function interface available in Kubeless.</p>\n<p>Besides the build template, a custom Docker registry is required to store the build artifacts, and a storage solution to store the function code. This could be either a Git repository or a blob storage like Minio or S3. In the end, customers should be able to decide if they like to keep the function code in their own Git repository or if they prefer to store it in a storage solution provided by Kyma.</p>\n<h2>Implementation</h2>\n<p>As the implementation involves multiple components and will involve breaking changes, we will keep Kubeless till we are sure that the new version is working as expected. In the first step, Knative <code>Serving</code> and <code>Build</code> components will be integrated as optional Kyma modules. If this is working, other parts, such as the Docker registry, blob storage, and build template, will be enabled step by step. As the last step, a new (forked) lambda UI will be created and adjusted to the Knative needs. As soon as everything is working fine, Kubeless will fade out. Knative will be the new default component and Kubeless will be used as long as there are still any old deployments available. As soon as we are sure that nobody is using the old Kubeless-based implementation, we will remove it completely.</p>","frontmatter":{"date":"September 27, 2018","path":"/blog/replacing-kubeless-with-Knative","title":"Replacing Kubeless with Knative","author":"Johannes Engelke, Kyma Product Owner Serverless","tags":["kyma","cloud","Knative","application","extension","serverless","kubeless"]}}},"pageContext":{}}