{"data":{"markdownRemark":{"id":"4cea3c9a-73c1-50ad-ba4a-69d6c8283596","html":"<p>With winter holidays and 2019 around the corner, let's think about something hotter and more exotic. A city perhaps... Cairo? Sounds good, right? </p>\n<p>If you're wondering what does Cairo have to do with Kyma, we're happy to explain. We decided that new releases need a cool common identification theme. After a long, coffee-fuelled\nbrainstorming session we decided to name our releases after major cities in the world. Cool, right? </p>\n<p>Soooo... What can you expect from Kyma 0.6 Cairo? </p>\n<p>Knative integration is our main focus for this release. The new Knative Working Group (<a href=\"https://kyma-community.slack.com/messages/CEC6R4T6U\">click here to visit its Slack channel</a>) works tirelessly to make Knative components available in Kyma clusters.\nBy enabling a special toggle you will be able to delegate the eventing and messaging duties to Knative and use its ingress gateway for API exposure. </p>\n<p>The <a href=\"https://kyma-community.slack.com/messages/CD7GJ41QE\">Prow Working Group</a> is also firing on all cylinders. Soon all contributors will be able to see the build status and the logs for their pull requests. What's even more exciting, Cairo will be built using the new CI architecture!</p>\n<p>We're also working on a more consistent naming scheme for all of our components. As Kyma users are well familiar with Kubernetes Namespaces, we decided to abandon our custom term \"Environment\" and use the Kubernetes standard instead.<br>\nThe renaming will also affect the Application Connector, as we'll say goodbye to \"Remote Environments\" and start using the \"Application\" name instead. This is an important step that follows our <a href=\"https://github.com/kyma-project/community/blob/master/capabilities/application-connectivity.md\">Application Connectivity vision</a>. You can read more about both renaming efforts in <a href=\"https://kyma-community.slack.com/archives/CD0K2NSQZ/p1544519219008800\">this</a> Slack post. </p>\n<p>In parallel, we are working continuously on the Kyma UI/UX - you can expect a better navigation structure and technical foundation for UI modularization and extensibility, achieved by switching Console UI to Luigi framework. </p>\n<p>With the 0.6 release, we aim to improve code quality by introducing common libraries and unifying the acceptance tests code base. Additionally, the delivery of tools for testing the Service Catalog UI is planned.</p>\n<p>Last, but definitely not the least, we're continuously improving the security of Kyma. In the 0.6 release we're extending the UI-API Layer (GraphQL) with an authorization concept. </p>\n<p>You can find all items planned for the 0.6 in <a href=\"https://app.zenhub.com/workspaces/kyma---all-repositories-5b6d5985084045741e744dea/reports?report=release&#x26;release=5c015e1eda763f3a7c15abef\">Zenhub</a>. Come back and check out Kyma 0.6 Cairo when it's released on 14.01.2019 and keep an eye out for more Kyma news and updates on our blog. </p>\n<p>See you around!</p>","frontmatter":{"date":"December 11, 2018","path":"/blog/release-0.6-plan","title":"Kyma 0.6 Cairo scheduled for release on 14.01.2019","author":"Piotr Bochynski, Product Owner @Kyma","tags":["release"]}}},"pageContext":{}}