{"data":{"allMarkdownRemark":{"edges":[{"node":{"id":"6420fa07-3650-556b-b8ad-113eff39a64e","html":"<p>\n  <span\n    class=\"gatsby-resp-image-wrapper\"\n    style=\"position: relative; display: block; ; max-width: 400px; margin-left: auto; margin-right: auto;\"\n  >\n    <span\n      class=\"gatsby-resp-image-background-image\"\n      style=\"padding-bottom: 57.50000000000001%; position: relative; bottom: 0; left: 0; background-image: url('data:image/jpeg;base64,/9j/2wBDABALDA4MChAODQ4SERATGCgaGBYWGDEjJR0oOjM9PDkzODdASFxOQERXRTc4UG1RV19iZ2hnPk1xeXBkeFxlZ2P/2wBDARESEhgVGC8aGi9jQjhCY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2P/wgARCAAMABQDASIAAhEBAxEB/8QAGAAAAgMAAAAAAAAAAAAAAAAAAAMBAgT/xAAVAQEBAAAAAAAAAAAAAAAAAAACA//aAAwDAQACEAMQAAABslkxajIWH//EABsQAAIDAAMAAAAAAAAAAAAAAAECAAMREyIx/9oACAEBAAEFAkA1uj8tsqOlvDP/xAAXEQADAQAAAAAAAAAAAAAAAAAAARES/9oACAEDAQE/AXIZR//EABgRAAIDAAAAAAAAAAAAAAAAAAASAQIR/9oACAECAQE/Aa6w0n//xAAbEAACAQUAAAAAAAAAAAAAAAAAARECECFRYf/aAAgBAQAGPwKdjgwVcHb/xAAaEAEBAQEAAwAAAAAAAAAAAAABEQAhQVFx/9oACAEBAAE/IbgPd3erheOIck+GYD5wxGhbuHf/2gAMAwEAAgADAAAAEMQf/8QAFxEBAQEBAAAAAAAAAAAAAAAAAQARUf/aAAgBAwEBPxDYEcL/xAAXEQADAQAAAAAAAAAAAAAAAAAAARFh/9oACAECAQE/EJM6aH//xAAaEAEAAwEBAQAAAAAAAAAAAAABABEhMUFR/9oACAEBAAE/EGmB6HsrRyVwG13ffI82xjfaMVmJ8iEC7suIUACf/9k='); background-size: cover; display: block;\"\n    >\n      <img\n        class=\"gatsby-resp-image-image\"\n        style=\"width: 100%; height: 100%; margin: 0; vertical-align: middle; position: absolute; top: 0; left: 0; box-shadow: inset 0px 0px 0px 400px white;\"\n        alt=\"Kyma at TechEd\"\n        title=\"\"\n        src=\"/static/kyma-at-sap-teched-f54d2eb13f245715d84db402f1d8d91c-4eb17.jpg\"\n        srcset=\"/static/kyma-at-sap-teched-f54d2eb13f245715d84db402f1d8d91c-f12c7.jpg 300w,\n/static/kyma-at-sap-teched-f54d2eb13f245715d84db402f1d8d91c-4eb17.jpg 400w\"\n        sizes=\"(max-width: 400px) 100vw, 400px\"\n      />\n    </span>\n  </span>\n  </p>\n<p><a href=\"https://events.sap.com/teched/en/home\">SAP TechEd</a> is the premier SAP technology conference, which takes place every year on 3 continents and is an excellent source of news on the technical and platform offerings of SAP. In 2018 the conference venues are located in Las Vegas, Barcelona, and Bangalore. </p>\n<p>As the centerpiece of a number of implementation projects, and the cornerstone of the upcoming SAP Cloud Platform Extension Factory Lab Preview, Kyma must be represented by the best ambassadors on each of the three events. These people will represent the product, answer all questions and be the first point of contact for all the attendees interested in Kyma.</p>\n<ul>\n<li>\n<p>For the <a href=\"http://events.sap.com/teched-2018-usa/en/home\">Las Vegas (02-05.Oct)</a> event the ambassadors include myself (<a href=\"https://twitter.com/evilyeti\">@evilyeti</a>), Gopi Kannappan (<a href=\"https://twitter.com/gopikannappan\">@gopikannappan</a>) and Hisar Balik. You can find us hanging around the SAP Cloud Platform booths and on the C/4 HANA sessions we have on the agenda.</p>\n</li>\n<li>\n<p><a href=\"http://events.sap.com/teched-2018-emea/en/home\">For the Barcelona (23-25.Oct)</a> event the ambassadors are Marco Dorn (<a href=\"https://twitter.com/mado0803\">@mado0803</a>), Stanimir Ivanov (<a href=\"https://twitter.com/s1vanov\">@s1vanov</a>) and Lukasz Szymik (<a href=\"https://twitter.com/lszymik\">@lszymik</a>) who will also be available either at the SAP Cloud Platform booths or at the C/4 HANA sessions they'll run.</p>\n</li>\n<li>\n<p>Last but not least – for the <a href=\"http://events.sap.com/teched-2018-india/en/home\">Bangalore (25-30.Nov)</a> event we have Johannes Engelke (<a href=\"https://twitter.com/quablab\">@quablab</a>) and Sayan Hazra as the ambassadors. They'll make sure to spread the word about Kyma, and tell the attendees all about the extensibility of the product, and the Serverless functions.</p>\n</li>\n</ul>\n<p>We're super excited to see the Kyma story grow and more ideas come onboard. Feel free to meet all of the ambassadors and talk about Kyma and software extensibility, or any ideas you might have around these topics. The conversation might get you some cool merch as we might have some stickers to share with our lovely guests. Don't be shy! See you there!</p>","frontmatter":{"date":"October 04, 2018","path":"/blog/blog-post-kyma-at-teched","title":"Kyma at SAP TechEd","author":"Krassimir Semerdzhiev, Kyma Open Source Strategist","tags":["kyma","ambassadors","event","extensibility","serverless","teched"]}}},{"node":{"id":"a91b470d-bf89-5915-bcfc-e0513e400f36","html":"<p><a href=\"https://github.com/Knative/\">Knative</a> is an important new project in the cloud-native world that was announced as a \"Kubernetes-based platform to build, deploy, and manage modern serverless workloads.\" It is an opinionated approach covering the best practices around three areas of developing cloud-native applications: building containers (and functions), serving (and dynamically scaling) workloads, and eventing. Knative is the open-source set of components and is actively developed by Google in close partnership with Pivotal, IBM, Red Hat, and SAP. </p>\n<p>Similarly to Kubeless, Knative provides a set of building blocks to make it simpler to use Kubernetes and Istio for managing and operating lambda functions. Kubeless takes some code, builds an image out of it, and starts it on Kubernetes. Knative is doing the same by following a more modular approach, allowing different components to be pluggable and adaptable to different deployment scenarios. </p>\n<p>Because of this more flexible approach, we are planning to replace the current Kubeless-based Lambda Functions in Kyma with a Knative-based implementation. To provide the same commodity as our users are used to with Kubeless, we have to do some extra work.</p>\n<h2>Architecture</h2>\n<p>So far, the architecture is not shaped out fully. Many details have to be sorted out and defined. The idea is to use Knative as it is and try to bridge the existing gaps using custom components, available other open-source projects (e.g. <a href=\"https://projectriff.io/\">Riff</a>), or pushing enhancements to the Knative community. In the end, Knative should provide the same functionality as Kubeless is doing today.</p>\n<p>\n  <span\n    class=\"gatsby-resp-image-wrapper\"\n    style=\"position: relative; display: block; ; max-width: 409px; margin-left: auto; margin-right: auto;\"\n  >\n    <span\n      class=\"gatsby-resp-image-background-image\"\n      style=\"padding-bottom: 107.82396088019561%; position: relative; bottom: 0; left: 0; background-image: url('data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAABQAAAAWCAYAAADAQbwGAAAACXBIWXMAAAsSAAALEgHS3X78AAACDUlEQVQ4y4WV167CQAxE9/9/iXfEI/CEKEJ0RO8djI6lQb5J4FpasdmMx+OyIY3HYzudTrbf7+1wOPhiz+J8Op1atVq1er1uESt89NvtdpbW67WDjsejH/Irp+1266DZbGbz+dyfhRWe581m8/FNj8fD7ve73W43GwwG1mg0rNlsWq/Xc4LX62XP59MXWHDg2YMHR9DL5eJnyYLhdL1e/SUKSVFkRcY5AUajkQfBEgq0MNUC+fyiEge9j8bZarUyyrZcLp00CahflEkVajGIUaL0SQ2jdgRTYJ5TjCZnrN1uW6lU8i6jFgdIVRL2KGu1WlapVHxP83KEUogje9RQBkhUp2iTycQbg9I/TYmEOCs1fkmFPRgCKWWe2Z/P50+Zck2RIkhIQUMba026qulisfBy0ByCJftigBnaX8ZYsSASaaIuSI0DrOZwOzRvwgiHkSpEqISHBia6VKvVPD0A8VrpOhUtpUx3qTsCPGW6xFByoItOqkRlxY+BxofUpFKNkvoEGQaw2+1+0iQyjcEg4h2qsE6n47j4tVHQhArNGKQaAQhZuq8oBQOWc3D6sGj5HKIClZARud/ve0qKjDNDS411Zzn/9sHI3WXUkCLRUAN59oZEn+xKEaCoqh9kqMs6Z0lzCrNgiEgRUl27IkWFhDENvYSkXC77fwnkkfA/S0W1YSYZk+Fw6OlnA/6yNxkerdGfKtI9AAAAAElFTkSuQmCC'); background-size: cover; display: block;\"\n    >\n      <img\n        class=\"gatsby-resp-image-image\"\n        style=\"width: 100%; height: 100%; margin: 0; vertical-align: middle; position: absolute; top: 0; left: 0; box-shadow: inset 0px 0px 0px 400px white;\"\n        alt=\"Serverless Kyma Architecture\"\n        title=\"\"\n        src=\"/static/3-serverless-kyma-architecture-64cc827600f930648359faad8f242539-091ba.png\"\n        srcset=\"/static/3-serverless-kyma-architecture-64cc827600f930648359faad8f242539-3586d.png 300w,\n/static/3-serverless-kyma-architecture-64cc827600f930648359faad8f242539-091ba.png 409w\"\n        sizes=\"(max-width: 409px) 100vw, 409px\"\n      />\n    </span>\n  </span>\n  </p>\n<p>The core of the architecture are the Knative <code>Serving</code> and <code>Build</code> components. As a Kyma-related component, a custom build template is required to provide the function interface available in Kubeless.</p>\n<p>Besides the build template, a custom docker registry is required to store the build artifacts, and a storage solution to store the function code. This could be either a Git repository or a blob storage like Minio or S3. In the end, customers should be able to decide if they like to keep the function code in their own Git repository or if they prefer to store it in a storage solution provided by Kyma.</p>\n<h2>Implementation</h2>\n<p>As the implementation involves multiple components and will involve breaking changes, we will keep Kubeless till we are sure that the new version is working as expected. In the first step, Knative <code>Serving</code> and <code>Build</code> components will be integrated as optional Kyma modules. If this is working, other parts, such as the Docker registry, blob storage, build template will be enabled step by step. As the last step, a new (forked) lambda UI will be created and adjusted to the Knative needs. As soon as everything is working fine, Kubeless will fade out. That being said, Knative will be the new default component and Kubeless can be used as long as there are still any old deployments available. As soon as we are sure that nobody is using the old Kubeless-based implementation, it will be removed completely.</p>","frontmatter":{"date":"September 27, 2018","path":"/blog/how-kubeless-will-be-replaced-with-Knative","title":"How Kubeless will be replaced with Knative","author":"Johannes Engelke, Kyma Product Owner Serverless","tags":["kyma","cloud","Knative","application","extension","serverless","kubeless"]}}},{"node":{"id":"1fa009de-ca92-5b78-aab2-15ccdd82e297","html":"<p>Now that Kyma is out there available to the world you are most probably keen on testing and implementing your own scenarios leveraging Kyma. Well, we are happy to introduce you to a getting started guide for developers which is <a href=\"https://github.com/kyma-incubator/examples/tree/master/personservice\">a sample application based on Spring Boot</a> showing the features on Kyma.</p>\n<p>This hands-on guide provides an end-to-end example application implementation in Java and Spring Boot running on Kyma. In the end state, you as a developer will understand all the features Kyma delivers. To summarize, this guide teaches you how to:</p>\n<ul>\n<li>Deploy the application locally to Kyma (based on minikube) or to an actual Kyma cluster </li>\n<li>Connect your service to Kyma as an extension platform and run a scenario</li>\n<li>Extend business applications with Kyma through event-driven, Lambda (serverless) functions</li>\n<li>Bind your application to a brokered backing service</li>\n<li>Add authentication and authorization</li>\n<li>Leverage Kubernetes Self-Healing</li>\n<li>Use tracing and logging support</li>\n</ul>\n<p>We would like to hear your feedback. If you face any issues or have any comments while testing Kyma, feel free to report them on <a href=\"https://github.com/kyma-incubator/examples\">GitHub</a>.  </p>\n<p>We also invite you to join the Kyma community on <a href=\"https://twitter.com/kymaproject\">Twitter</a> and <a href=\"https://www.linkedin.com/company/kyma-project/\">LinkedIn</a>. </p>\n<p>Have fun with Kyma! </p>","frontmatter":{"date":"September 24, 2018","path":"/blog/start-with-person-service","title":"Get started guide for developers on Kyma","author":"Andreas Krause, Kyma Cloud Software Enablement","tags":["kyma","cloud","native","application","extension","example","integration"]}}},{"node":{"id":"d2303ac8-bcb7-5e45-b068-79266f4f01fe","html":"<p>When Kyma was introduced to the public a few weeks ago at <a href=\"https://cloud.withgoogle.com/next18/sf/\">Google Cloud Next ’18</a>, we talked about the strong partnership that we have with the Knative community. Kyma and Knative provide two complementary sets of building blocks, which together offer a powerful framework and a toolset to build cloud-native solutions on top of Kubernetes.</p>\n<p>\n  <span\n    class=\"gatsby-resp-image-wrapper\"\n    style=\"position: relative; display: block; ; max-width: 942px; margin-left: auto; margin-right: auto;\"\n  >\n    <span\n      class=\"gatsby-resp-image-background-image\"\n      style=\"padding-bottom: 51.69851380042463%; position: relative; bottom: 0; left: 0; background-image: url('data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAABQAAAAKCAIAAAA7N+mxAAAACXBIWXMAAA7DAAAOwwHHb6hkAAABT0lEQVQoz3VRO04DMRDd43ACCmpqRMVBaDgBEgUFBRQUXICCEgQFIEVCqSLRQNAiEfB6I4eskhh2bY/tMbPr/BSUp5U1fut5bz5JmAEAjDF0hvUAh87j/JrMo6IoOOd5niulViTi866Adk+l32D9v+SIqqp4AyklFWKtjTz53byU22f5yeMYcaqYLMsTG39orTnPcs6knIQwJd8E3L1WHaYRl5wR0VhvwFNBFMSuwIUfhRrq2DoEV/POIS5aDgm9rrSrjMuGOs2q4RhIhRgxgk+hByOjwE9K2xP6a2BSrgoJ2njbTC6xMzE6vQ/xQg6+8a8baUxq2/qb9k8G1mISMz3i/uXz7unTxe37h/iNI/DeZ4zlnK/bXBIdWt3BxsH11tHDznFLaTcfkm1A++v3+6S1mhzrFFLvnbc3D++vOjwWstgCUgu+LEvGmBBiWeIPUBw8jwKSIDgAAAAASUVORK5CYII='); background-size: cover; display: block;\"\n    >\n      <img\n        class=\"gatsby-resp-image-image\"\n        style=\"width: 100%; height: 100%; margin: 0; vertical-align: middle; position: absolute; top: 0; left: 0; box-shadow: inset 0px 0px 0px 400px white;\"\n        alt=\"Kyma and Knative\"\n        title=\"\"\n        src=\"/static/1-kyma-knative-3e84475451c89bc10b90ee375732b367-78475.png\"\n        srcset=\"/static/1-kyma-knative-3e84475451c89bc10b90ee375732b367-06d5c.png 300w,\n/static/1-kyma-knative-3e84475451c89bc10b90ee375732b367-385cc.png 600w,\n/static/1-kyma-knative-3e84475451c89bc10b90ee375732b367-78475.png 942w\"\n        sizes=\"(max-width: 942px) 100vw, 942px\"\n      />\n    </span>\n  </span>\n  </p>\n<p>If you look at the Kyma source code right now, you might wonder why you are not finding many references to Knative. The answer is quite simple. In the last month and a half, the entire Kyma team has been working on restructuring the repositories, making them ready to go open source and removing all internal references and tool dependencies. We've done all of that from a stable branch.  </p>\n<p>In parallel to those major changes, we have a fork with Kyma and Knative integrated. It was used to build some first proof-of-concept cloud-native solutions using Knative and Kyma deployed together. The fork is also the basis for our stage demo shown during <a href=\"https://www.youtube.com/watch?v=NaaGPGKyXEc&#x26;t=42m50s\">the project launch</a>. This was our first approach at combining the projects. As both Kyma and Knative are really young and going through a number of changes, some of our design decisions have not been optimal in retrospect. </p>\n<p>During the coming weeks, our plan is to refactor the current Kyma codebase and modularize it. Several functional components can then be installed optionally, which will certainly improve the experience when developing locally using for example <a href=\"https://kubernetes.io/docs/tasks/tools/install-minikube/\">Minikube</a>. </p>\n<p>As shared technologies such as <a href=\"https://istio.io/\">Istio</a> are concerned, we're going to provide needed configuration options so that Istio deployed with Knative will also support all Kyma's requirements. </p>\n<p>And finally, we are going to extract some components. For example, we'll extract Kyma eventing and fully integrate it with Knative eventing. We'll evaluate the possibility of contributing the Kyma eventing based on <a href=\"https://nats.io/\">NATS</a> streaming as a Knative compatible eventing implementation to the Knative project. Users of Knative and Kyma will than have the additional option of deciding which eventing implementation to use (e.g. as an alternative to the Knative provided Kafka based implementation). </p>\n<p>Stay tuned for more updates! Remember! Your ideas and proposals are highly welcome. Don't be shy!  </p>","frontmatter":{"date":"August 10, 2018","path":"/blog/kyma-knative-progress-report","title":"Kyma and Knative Integration - Progress Update","author":"Ralf Hofmann, Kyma Cloud Software Architecture","tags":["kyma","cloud","native","GoogleNext2018","knative","istio","kubernetes"]}}},{"node":{"id":"d4a5e1a5-1032-5716-9664-78ee376437b1","html":"<p>At SAP we typically deal with lots of enterprise software coming from a variety of different vendors. We've helped many of our customers and partners in all industries to model software to their needs and unique business processes. To meet the desire for flexibility, we see a growing demand for openness and modern architecture in this space. That's why we decided to spin the development of our new extension framework, Kyma, out in open source. We’d like to encourage all of you to take a look, get involved and lend a hand to expand Kyma to cover even more exciting extension scenarios.</p>\n<p>The ideas and concepts in Kyma result out of long years of experience in customizing different SAP and SAP Hybris solutions. It lets you create serverless applications, mashups and micro services – all running on the underlying Kubernetes+Istio – both serving as the foundation of Kyma. On top we enable developers to quickly code small customization modules and extension apps, interweaved with the business logic of the extended enterprise application. </p>\n<p>And then <a href=\"https://cloud.google.com/knative/\">Knative</a> came into the picture. Build from the ground up to support, container-based and cloud-native applications – it provides building blocks for developers to build and deploy container-based serverless applications anywhere on Kubernetes. Sounds familiar, right? All of us at SAP were super excited to see that the Knative dev team has taken very similar technology decisions. It felt like a validation of our Kyma scenarios from one side as well as the technology vision we had in the broader SAP Hybris team from another. From that point on – it was clear that Kyma and Knative are bound to grow together. On our end – we’ve refactored Kyma to leverage Knative configuration, build and serving components already from the on-start. We dropped some of the overlapping components, making Kyma leaner and more streamlined. We got as well all-in involved in Knative, having the opportunity to work with the incredible Google Cloud team.</p>\n<p>A quote coming from the discussions, that stuck and made the whole Kyma team at SAP incredibly proud was:</p>\n<blockquote>\n<p>\"SAP's extensive enterprise expertise and far-reaching commercial experience made for an ideal partnership as we developed Knative. SAP brought informed customer-driven use-cases to the table, helping us collectively shape the capabilities of Knative to meet the needs of real-world businesses. Knative and SAP Kyma make a perfect fit, and we look forward to the ongoing technical collaboration.” -DeWitt Clinton, Google Cloud</p>\n</blockquote>\n<p>This collaboration gives us the chance to focus Kyma on the higher-level enterprise application connectivity and service consumption scenarios, relying on Knative for all the low-level infrastructure and development scenarios. </p>\n<p>We strongly believe in open technologies and open collaboration. Our goal is to join forces with interested parties out there and to build the most flexible extension framework for any SaaS applications to be customized and extended.  </p>\n<p>Got you interested? Want to get involved? Get in touch with us via <a href=\"https://twitter.com/kymaproject\">Twitter</a>, <a href=\"https://github.com/kyma-project\">GitHub</a> or our <a href=\"https://join.slack.com/t/kyma-community/shared_invite/enQtNDAwNzE4Mjk2NDE3LTJhOTlmZjM5YzkwNmEzNmY3ZjE2MTU2OTMxOGE4ZDM0MmU4ZWRkZGJiODgzNmRmMTYxMDYwNjZiMDAwMTA2OWM\">Slack</a> channel. We would also be very happy if you simply let us know your take on this!</p>\n<p>Stay tuned for more updates... and have a great #GoogleNext2018!</p>","frontmatter":{"date":"July 24, 2018","path":"/blog/introducing-project-kyma","title":"Introducing project Kyma","author":"Krasimir Semerdzhiev, Kyma Open Source Strategist","tags":["kyma","cloud","native","GoogleNext2018","knative","istio","kubernetes"]}}}]}},"pageContext":{}}